<a href="https://colab.research.google.com/github/triatebr/aprenda-python/blob/master/PivotData_byPython.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df = pd.DataFrame({'ID': ['21678122','21678122','21678122','21678122','21678122','21678233','21678233','21678233','21678233','21678155', '21678155','21678155', '21678155','21678155', '21678155','21678154', '21678154', '21678154', '21678154','21678154','21678154'],
                   'DATE': ['10/02/2019','11/09/2019','19/02/2019','26/02/2019','28/02/2019','02/02/2019','05/02/2019','25/02/2019','28/02/2019','01/02/2019','08/02/2019' ,'15/02/2019','22/02/2019', '25/02/2019','27/02/2019', '01/02/2019','05/02/2019','11/02/2019', '22/02/2019', '27/02/2019','28/02/2019'],
                   'CURSO': ['Direito','Direito','Direito','Direito','Direito','Economia','Economia','Economia','Economia','Tecnólogo em Gestão Financeira','Tecnólogo em Gestão Financeira', 'Tecnólogo em Gestão Financeira','Tecnólogo em Gestão Financeira', 'Tecnólogo em Gestão Financeira', 'Tecnólogo em Gestão Financeira', 'Administração de Empresas', 'Administração de Empresas', 'Administração de Empresas','Administração de Empresas', 'Administração de Empresas','Administração de Empresas'],
                   'PRECO': [454,456,489,478,499,897,845,852,841,221,225,250,265,290,244,348,345,356,360,385,391],
                   'DESCONTO': [414,425,436,441,425,845,865,841,859,217,221,244,235,221,240,342,340,350,358,379,388]})

In [3]:
df

                             CURSO        DATE  DESCONTO        ID  PRECO
0                          Direito  10/02/2019       414  21678122    454
1                          Direito  11/09/2019       425  21678122    456
2                          Direito  19/02/2019       436  21678122    489
3                          Direito  26/02/2019       441  21678122    478
4                          Direito  28/02/2019       425  21678122    499
5                         Economia  02/02/2019       845  21678233    897
6                         Economia  05/02/2019       865  21678233    845
7                         Economia  25/02/2019       841  21678233    852
8                         Economia  28/02/2019       859  21678233    841
9   Tecnólogo em Gestão Financeira  01/02/2019       217  21678155    221
10  Tecnólogo em Gestão Financeira  08/02/2019       221  21678155    225
11  Tecnólogo em Gestão Financeira  15/02/2019       244  21678155    250
12  Tecnólogo em Gestão Financeira  22/02/2019       235  21678155    265
13  Tecnólogo em Gestão Financeira  25/02/2019       221  21678155    290
14  Tecnólogo em Gestão Financeira  27/02/2019       240  21678155    244
15       Administração de Empresas  01/02/2019       342  21678154    348
16       Administração de Empresas  05/02/2019       340  21678154    345
17       Administração de Empresas  11/02/2019       350  21678154    356
18       Administração de Empresas  22/02/2019       358  21678154    360
19       Administração de Empresas  27/02/2019       379  21678154    385
20       Administração de Empresas  28/02/2019       388  21678154    391

**AGRUPANDO** dados de PREÇO e DATA por **ID**

In [0]:
#começamos pela data
def custom(series):
    min_date = list(series)[0]
    pen_date = list(series)[-2]
    max_date = list(series)[-1]
    
    return min_date,pen_date,max_date

In [0]:
#depois vamos para o preço
def get_price(series):
    price_a = list(series)[0]
    price_c = list(series)[-2]
    price_b = list(series)[-1]
    
    return price_a,price_c,price_b

In [0]:
#para o AGRUPAMENTO funcionar temos que atribui-lo ao um DF
dfa=df.groupby(["ID"], as_index=False).agg({"DATE":custom,"PRECO":get_price})

In [7]:
#agrupamento realizado, nota-se que TODAS as datas estão juntas e os valores idem
dfa

         ID                                  DATE            PRECO
0  21678122  (10/02/2019, 26/02/2019, 28/02/2019)  (454, 478, 499)
1  21678154  (01/02/2019, 27/02/2019, 28/02/2019)  (348, 385, 391)
2  21678155  (01/02/2019, 25/02/2019, 27/02/2019)  (221, 290, 244)
3  21678233  (02/02/2019, 25/02/2019, 28/02/2019)  (897, 852, 841)

**SEPARAR** datas e valores

In [0]:
#cria-se uma função para levantar e limpar os dados (data e preço)
def get_data_price(row, index):
    #recuperando do dados
    date  = str(row['DATE']).split(',')[index]
    price = str(row['PRECO']).split(',')[index]
    
    #limpeza de dados
    date  = date.replace("(","").replace(")","")
    price = price.replace("(","").replace(")","")
    
    return pd.Series([date,price])

In [0]:
#atribui-se agora o 1º, penúltimo e último preço e data
dfa[["1a_data","1o_preço"]] = dfa.apply(lambda row: get_data_price(row,0),axis = 1)
dfa[["pen_data","pen_preço"]] = dfa.apply(lambda row: get_data_price(row,1),axis = 1)
dfa[["ult_data","ult_preço"]] = dfa.apply(lambda row: get_data_price(row,2),axis = 1)

In [10]:
#deletar a coluna DATE e PRECO, sem funcionalidade a partir de agora
dfa.drop(['DATE','PRECO'],axis = 1)

,ID,1a_data,1o_preço,pen_data,pen_preço,ult_data,ult_preço
0,21678122,'10/02/2019',454,'26/02/2019',478,'28/02/2019',499
1,21678154,'01/02/2019',348,'27/02/2019',385,'28/02/2019',391
2,21678155,'01/02/2019',221,'25/02/2019',290,'27/02/2019',244
3,21678233,'02/02/2019',897,'25/02/2019',852,'28/02/2019',841